Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/svd/PIC32CX5112MTSH128S1.svd
            <register>
               <name>WPMR</name>
               <description>Write Protection Mode Register</description>
               <addressOffset>0x14C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPITEN</name>
                     <description>Write Protection Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPCREN</name>
                     <description>Write Protection Control Register Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.</description>
                           <value>0x414443</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPSR</name>
               <description>Write Protection Status Register</description>
               <addressOffset>0x150</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protection Violation Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPVSRC</name>
                     <description>Write Protection Violation Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>CHIPID</name>
         <version>6417ZW</version>
         <description>Chip Identifier</description>
         <groupName>CHIPID</groupName>
         <prependToName>CHIPID_</prependToName>
         <baseAddress>0x40050200</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CIDR</name>
               <description>Chip ID Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>VERSION</name>
                     <description>Version of the Device</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>EPROC</name>
                     <description>Embedded Processor</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>EPROCSelect</name>
                        <enumeratedValue>
                           <name>SAMx7</name>
                           <description>Cortex-M7</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ARM946ES</name>
                           <description>ARM946ES</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ARM7TDMI</name>
                           <description>ARM7TDMI</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CM3</name>
                           <description>Cortex-M3</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ARM920T</name>
                           <description>ARM920T</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ARM926EJS</name>
                           <description>ARM926EJS</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CA5</name>
                           <description>Cortex-A5</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CM4</name>
                           <description>Cortex-M4</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NVPSIZ</name>
                     <description>Nonvolatile Program Memory Size</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>NVPSIZSelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>None</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_8K</name>
                           <description>8 Kbytes</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16K</name>
                           <description>16 Kbytes</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32K</name>
                           <description>32 Kbytes</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64K</name>
                           <description>64 Kbytes</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_128K</name>
                           <description>128 Kbytes</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_160K</name>
                           <description>160 Kbytes</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_256K</name>
                           <description>256 Kbytes</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_512K</name>
                           <description>512 Kbytes</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1024K</name>
                           <description>1024 Kbytes</description>
                           <value>0xC</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2048K</name>
                           <description>2048 Kbytes</description>
                           <value>0xE</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NVPSIZ2</name>
                     <description>Second Nonvolatile Program Memory Size</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>NVPSIZ2Select</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>None</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_8K</name>
                           <description>8 Kbytes</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16K</name>
                           <description>16 Kbytes</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32K</name>
                           <description>32 Kbytes</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64K</name>
                           <description>64 Kbytes</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_128K</name>
                           <description>128 Kbytes</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_256K</name>
                           <description>256 Kbytes</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_512K</name>
                           <description>512 Kbytes</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1024K</name>
                           <description>1024 Kbytes</description>
                           <value>0xC</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2048K</name>
                           <description>2048 Kbytes</description>
                           <value>0xE</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRAMSIZ</name>
                     <description>Internal SRAM Size</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>SRAMSIZSelect</name>
                        <enumeratedValue>
                           <name>_48K</name>
                           <description>48 Kbytes</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_192K</name>
                           <description>192 Kbytes</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_384K</name>
                           <description>384 Kbytes</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_6K</name>
                           <description>6 Kbytes</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_24K</name>
                           <description>24 Kbytes</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_4K</name>
                           <description>4 Kbytes</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_80K</name>
                           <description>80 Kbytes</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_160K</name>
                           <description>160 Kbytes</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_8K</name>
                           <description>8 Kbytes</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16K</name>
                           <description>16 Kbytes</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32K</name>
                           <description>32 Kbytes</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64K</name>
                           <description>64 Kbytes</description>
                           <value>0xB</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_128K</name>
                           <description>128 Kbytes</description>
                           <value>0xC</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_256K</name>
                           <description>256 Kbytes</description>
                           <value>0xD</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_96K</name>
                           <description>96 Kbytes</description>
                           <value>0xE</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_512K</name>
                           <description>512 Kbytes</description>
                           <value>0xF</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ARCH</name>
                     <description>Architecture Identifier</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>ARCHSelect</name>
                        <enumeratedValue>
                           <name>PIC32CXMTSH128</name>
                           <description>Dual Core, Single Phase, High Accuracy (128-lead version)</description>
                           <value>0xC3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PIC32CXMTC128</name>
                           <description>Dual Core (128-lead version)</description>
                           <value>0xC5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PIC32CXMTG64</name>
                           <description>Single Core (64-lead version)</description>
                           <value>0xC6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PIC32CXMTG128</name>
                           <description>Single Core (128-lead version)</description>
                           <value>0xC8</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NVPTYP</name>
                     <description>Nonvolatile Program Memory Type</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>NVPTYPSelect</name>
                        <enumeratedValue>
                           <name>ROM</name>
                           <description>ROM</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ROMLESS</name>
                           <description>ROMless or on-chip Flash</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FLASH</name>
                           <description>Embedded Flash Memory</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ROM_FLASH</name>
                           <description>ROM and Embedded Flash Memory - NVPSIZ is ROM size - NVPSIZ2 is Flash size</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SRAM</name>
                           <description>SRAM emulating ROM</description>
                           <value>0x4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EXT</name>
                     <description>Extension Flag</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EXID</name>
               <description>Chip ID Extension Register</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>EXID</name>
                     <description>Chip ID Extension</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
