Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/svd/PIC32CX5112MTSH128S1.svd
            <register>
               <name>FLEX_TWI_CR_FIFO_ENABLED_MODE</name>
               <description>TWI Control Register</description>
               <alternateRegister>FLEX_TWI_CR</alternateRegister>
               <addressOffset>0x600</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>START</name>
                     <description>Send a START Condition</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STOP</name>
                     <description>Send a STOP Condition</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MSEN</name>
                     <description>TWI Host Mode Enabled</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MSDIS</name>
                     <description>TWI Host Mode Disabled</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SVEN</name>
                     <description>TWI Client Mode Enabled</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SVDIS</name>
                     <description>TWI Client Mode Disabled</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>QUICK</name>
                     <description>SMBus Quick Command</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HSEN</name>
                     <description>TWI High-Speed Mode Enabled</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HSDIS</name>
                     <description>TWI High-Speed Mode Disabled</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMBEN</name>
                     <description>SMBus Mode Enabled</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMBDIS</name>
                     <description>SMBus Mode Disabled</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PECEN</name>
                     <description>Packet Error Checking Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PECDIS</name>
                     <description>Packet Error Checking Disable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PECRQ</name>
                     <description>PEC Request</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLEAR</name>
                     <description>Bus CLEAR Command</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACMEN</name>
                     <description>Alternative Command Mode Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACMDIS</name>
                     <description>Alternative Command Mode Disable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFCLR</name>
                     <description>Transmit FIFO Clear</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFCLR</name>
                     <description>Receive FIFO Clear</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFLCLR</name>
                     <description>Transmit FIFO Lock CLEAR</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FIFOEN</name>
                     <description>FIFO Enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FIFODIS</name>
                     <description>FIFO Disable</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_TWI_MMR</name>
               <description>TWI Host Mode Register</description>
               <addressOffset>0x604</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>IADRSZ</name>
                     <description>Internal Device Address Size</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>IADRSZSelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No internal device address</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1_BYTE</name>
                           <description>One-byte internal device address</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2_BYTE</name>
                           <description>Two-byte internal device address</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3_BYTE</name>
                           <description>Three-byte internal device address</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MREAD</name>
                     <description>Host Read Direction</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCLRBL</name>
                     <description>SCL Rise Boost Level</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DADR</name>
                     <description>Device Address</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>NOAP</name>
                     <description>No Auto-Stop On NACK Error</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_TWI_SMR</name>
               <description>TWI Client Mode Register</description>
               <addressOffset>0x608</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>NACKEN</name>
                     <description>Client Receiver Data Phase NACK Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMDA</name>
                     <description>SMBus Default Address</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMHH</name>
                     <description>SMBus Host Header</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SADAT</name>
                     <description>Client Address Treated as Data</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BSEL</name>
                     <description>TWI Bus Selection</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCLWSDIS</name>
                     <description>Clock Wait State Disable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SNIFF</name>
                     <description>Client Sniffer Mode</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MASK</name>
                     <description>Client Address Mask</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SADR</name>
                     <description>Client Address</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SADR1EN</name>
                     <description>Client Address 1 Enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SADR2EN</name>
                     <description>Client Address 2 Enable</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SADR3EN</name>
                     <description>Client Address 3 Enable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATAMEN</name>
                     <description>Data Matching Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_TWI_IADR</name>
               <description>TWI Internal Address Register</description>
               <addressOffset>0x60C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>IADR</name>
                     <description>Internal Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_TWI_CWGR</name>
               <description>TWI Clock Waveform Generator Register</description>
               <addressOffset>0x610</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CLDIV</name>
                     <description>Clock Low Divider</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CHDIV</name>
                     <description>Clock High Divider</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CKDIV</name>
                     <description>Clock Divider</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>BRSRCCLK</name>
                     <description>Bit Rate Source Clock</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BRSRCCLKSelect</name>
                        <enumeratedValue>
                           <name>PERIPH_CLK</name>
                           <description>The peripheral clock is the source clock for the bit rate generation.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK</name>
                           <description>GCLK is the source clock for the bit rate generation, thus the bit rate can be independent of the core/peripheral clock.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HOLD</name>
                     <description>TWD Hold Time Versus TWCK Falling</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_TWI_SR</name>
               <description>TWI Status Register</description>
               <addressOffset>0x620</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TXCOMP</name>
                     <description>Transmission Completed (cleared by writing FLEX_TWI_THR)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXRDY</name>
                     <description>Receive Holding Register Ready (cleared when reading FLEX_TWI_RHR)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXRDY</name>
                     <description>Transmit Holding Register Ready (cleared by writing FLEX_TWI_THR)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SVREAD</name>
                     <description>Client Read</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SVACC</name>
                     <description>Client Access</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GACC</name>
                     <description>General Call Access (cleared on read)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE</name>
                     <description>Overrun Error (cleared on read)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNRE</name>
                     <description>Underrun Error (cleared on read)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NACK</name>
                     <description>Not Acknowledged (cleared on read)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARBLST</name>
                     <description>Arbitration Lost (cleared on read)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCLWS</name>
                     <description>Clock Wait State</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOSACC</name>
                     <description>End Of Client Access (cleared on read)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENDRX</name>
                     <description>End of RX Buffer (cleared by writing FLEX_TWI_RCR or FLEX_TWI_RNCR)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENDTX</name>
                     <description>End of TX Buffer (cleared by writing FLEX_TWI_TCR or FLEX_TWI_TNCR)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXBUFF</name>
                     <description>RX Buffer Full (cleared by writing FLEX_TWI_RCR or FLEX_TWI_RNCR)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXBUFE</name>
                     <description>TX Buffer Empty (cleared by writing FLEX_TWI_TCR or FLEX_TWI_TNCR)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCACK</name>
                     <description>Host Code Acknowledge (cleared on read)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMBAF</name>
                     <description>SMBus Alert Flag</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TOUT</name>
                     <description>Timeout Error (cleared on read)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PECERR</name>
                     <description>PEC Error (cleared on read)</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMBDAM</name>
                     <description>SMBus Default Address Match (cleared on read)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMBHHM</name>
                     <description>SMBus Host Header Address Match (cleared on read)</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>TWI Lock Due to Frame Errors</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCL</name>
                     <description>SCL Line Value</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SDA</name>
                     <description>SDA Line Value</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SR</name>
                     <description>Start Repeated</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
