Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/svd/PIC32CX5112MTSH128S1.svd
            <register>
               <name>FLEX_TWI_IMR</name>
               <description>TWI Interrupt Mask Register</description>
               <addressOffset>0x62C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TXCOMP</name>
                     <description>Transmission Completed Interrupt Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXRDY</name>
                     <description>Receive Holding Register Ready Interrupt Mask</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXRDY</name>
                     <description>Transmit Holding Register Ready Interrupt Mask</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SVACC</name>
                     <description>Client Access Interrupt Mask</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GACC</name>
                     <description>General Call Access Interrupt Mask</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE</name>
                     <description>Overrun Error Interrupt Mask</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNRE</name>
                     <description>Underrun Error Interrupt Mask</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NACK</name>
                     <description>Not Acknowledge Interrupt Mask</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARBLST</name>
                     <description>Arbitration Lost Interrupt Mask</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCL_WS</name>
                     <description>Clock Wait State Interrupt Mask</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOSACC</name>
                     <description>End Of Client Access Interrupt Mask</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENDRX</name>
                     <description>End of Receive Buffer Interrupt Mask</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENDTX</name>
                     <description>End of Transmit Buffer Interrupt Mask</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXBUFF</name>
                     <description>Receive Buffer Full Interrupt Mask</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXBUFE</name>
                     <description>Transmit Buffer Empty Interrupt Mask</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCACK</name>
                     <description>Host Code Acknowledge Interrupt Mask</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TOUT</name>
                     <description>Timeout Error Interrupt Mask</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PECERR</name>
                     <description>PEC Error Interrupt Mask</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMBDAM</name>
                     <description>SMBus Default Address Match Interrupt Mask</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMBHHM</name>
                     <description>SMBus Host Header Address Match Interrupt Mask</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_TWI_RHR</name>
               <description>TWI Receive Holding Register</description>
               <addressOffset>0x630</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXDATA</name>
                     <description>Host or Client Receive Holding Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SSTATE</name>
                     <description>Start State (Client Sniffer Mode only)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SSTATESelect</name>
                        <enumeratedValue>
                           <name>NOSTART</name>
                           <description>No START detected with the logged data</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>START</name>
                           <description>START (S) detected with the logged data</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RSTART</name>
                           <description>Repeated START (Sr) detected with the logged data</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UNDEF</name>
                           <description>Not defined</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PSTATE</name>
                     <description>Stop State (Client Sniffer Mode only)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ASTATE</name>
                     <description>Acknowledge State (Client Sniffer Mode only)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>ASTATESelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Acknowledge or Nacknowledge detected after previously logged data</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ACK</name>
                           <description>Acknowledge (A) detected after previously logged data</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NACK</name>
                           <description>Nacknowledge (NA) detected after previously logged data</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UNDEF</name>
                           <description>Not defined</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_TWI_RHR_FIFO_ENABLED_MODE</name>
               <description>TWI Receive Holding Register</description>
               <alternateRegister>FLEX_TWI_RHR</alternateRegister>
               <addressOffset>0x630</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXDATA0</name>
                     <description>Host or Client Receive Holding Data 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RXDATA1</name>
                     <description>Host or Client Receive Holding Data 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RXDATA2</name>
                     <description>Host or Client Receive Holding Data 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RXDATA3</name>
                     <description>Host or Client Receive Holding Data 3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_TWI_THR</name>
               <description>TWI Transmit Holding Register</description>
               <addressOffset>0x634</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>TXDATA</name>
                     <description>Host or Client Transmit Holding Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_TWI_THR_FIFO_ENABLED_MODE</name>
               <description>TWI Transmit Holding Register</description>
               <alternateRegister>FLEX_TWI_THR</alternateRegister>
               <addressOffset>0x634</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>TXDATA0</name>
                     <description>Host or Client Transmit Holding Data 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TXDATA1</name>
                     <description>Host or Client Transmit Holding Data 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TXDATA2</name>
                     <description>Host or Client Transmit Holding Data 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TXDATA3</name>
                     <description>Host or Client Transmit Holding Data 3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_TWI_SMBTR</name>
               <description>TWI SMBus Timing Register</description>
               <addressOffset>0x638</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PRESC</name>
                     <description>SMBus Clock Prescaler</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TLOWS</name>
                     <description>Client Clock Stretch Maximum Cycles</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TLOWM</name>
                     <description>Host Clock Stretch Maximum Cycles</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>THMAX</name>
                     <description>Clock High Maximum Cycles</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_TWI_HSR</name>
               <description>TWI High Speed Register</description>
               <addressOffset>0x63C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MCODE</name>
                     <description>TWI High Speed Host Code</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_TWI_ACR</name>
               <description>TWI Alternative Command Register</description>
               <addressOffset>0x640</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DATAL</name>
                     <description>Data Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DIR</name>
                     <description>Transfer Direction</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PEC</name>
                     <description>PEC Request (SMBus Mode only)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NDATAL</name>
                     <description>Next Data Length</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>NDIR</name>
                     <description>Next Transfer Direction</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NPEC</name>
                     <description>Next PEC Request (SMBus Mode only)</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_TWI_FILTR</name>
               <description>TWI Filter Register</description>
               <addressOffset>0x644</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FILT</name>
                     <description>RX Digital Filter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PADFEN</name>
                     <description>PAD Filter Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>THRES</name>
                     <description>Digital Filter Threshold</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_TWI_HSCWGR</name>
               <description>TWI High Speed Clock Waveform Generator Register</description>
               <addressOffset>0x648</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>HSCLDIV</name>
                     <description>High Speed Clock Low Divider</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>HSCHDIV</name>
                     <description>High Speed Clock High Divider</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>HSCKDIV</name>
                     <description>High Speed Clock Divider</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_TWI_SWMR</name>
               <description>TWI Matching Register</description>
               <addressOffset>0x64C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SADR1</name>
                     <description>Client Address 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SADR2</name>
                     <description>Client Address 2</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SADR3</name>
                     <description>Client Address 3</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>DATAM</name>
                     <description>Data Match</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
