Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/svd/PIC32CX5112MTSH128S1.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>RTC</name>
         <version>04575G</version>
         <description>Real-time Clock</description>
         <groupName>RTC</groupName>
         <prependToName>RTC_</prependToName>
         <baseAddress>0x40053100</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xAE</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>RTC</name>
            <value>2</value>
         </interrupt>
         <registers>
            <register>
               <name>CR</name>
               <description>Control Register</description>
               <addressOffset>0x00</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>UPDTIM</name>
                     <description>Update Request Time Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>UPDTIMSelect</name>
                        <enumeratedValue>
                           <name>STOP_UPDATE</name>
                           <description>No effect or, if UPDTIM has been previously written to 1, stops the update procedure.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>START_UPDATE</name>
                           <description>Stops the RTC time counting. Second, minute and hour counters can be programmed once this bit is set and acknowledged by the bit ACKUPD of the RTC_SR.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UPDCAL</name>
                     <description>Update Request Calendar Register</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>UPDCALSelect</name>
                        <enumeratedValue>
                           <name>STOP_UPDATE</name>
                           <description>No effect or, if UPDCAL has been previously written to 1, stops the update procedure.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>START_UPDATE</name>
                           <description>Stops the RTC calendar counting.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TIMEVSEL</name>
                     <description>Time Event Selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TIMEVSELSelect</name>
                        <enumeratedValue>
                           <name>MINUTE</name>
                           <description>Minute change</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HOUR</name>
                           <description>Hour change</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MIDNIGHT</name>
                           <description>Every day at midnight</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOON</name>
                           <description>Every day at noon</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CALEVSEL</name>
                     <description>Calendar Event Selection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CALEVSELSelect</name>
                        <enumeratedValue>
                           <name>WEEK</name>
                           <description>Week change (every Monday at time 00:00:00)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MONTH</name>
                           <description>Month change (every 01 of each month at time 00:00:00)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YEAR</name>
                           <description>Year change (every January 1 at time 00:00:00)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MR</name>
               <description>Mode Register</description>
               <addressOffset>0x04</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>HRMOD</name>
                     <description>12-/24-hour Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>HRMODSelect</name>
                        <enumeratedValue>
                           <name>_24HOURS</name>
                           <description>24-hour mode is selected.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AMPM</name>
                           <description>12-hour mode is selected.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PERSIAN</name>
                     <description>PERSIAN Calendar</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PERSIANSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Gregorian calendar.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Persian calendar.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UTC</name>
                     <description>UTC Time Format</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>UTCSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Gregorian or Persian calendar.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>UTC format.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NEGPPM</name>
                     <description>NEGative PPM Correction</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>NEGPPMSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Positive correction (the divider will be slightly higher than 32768).</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Negative correction (the divider will be slightly lower than 32768).</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CORRECTION</name>
                     <description>Slow Clock Correction</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>HIGHPPM</name>
                     <description>HIGH PPM Correction</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>HIGHPPMSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Lower range ppm correction with accurate correction (below 30ppm correction).</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Higher range ppm correction with accurate correction (higher than 30ppm correction).</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OUT0</name>
                     <description>RTCOUT0 OutputSource Selection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>OUT0Select</name>
                        <enumeratedValue>
                           <name>NO_WAVE</name>
                           <description>No waveform, stuck at '0'</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FREQ1HZ</name>
                           <description>1 Hz square wave</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FREQ32HZ</name>
                           <description>32 Hz square wave</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FREQ64HZ</name>
                           <description>64 Hz square wave</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FREQ512HZ</name>
                           <description>512 Hz square wave</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALARM_TOGGLE</name>
                           <description>Output toggles when alarm flag rises</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALARM_FLAG</name>
                           <description>Output is a copy of the alarm flag</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PROG_PULSE</name>
                           <description>Duty cycle programmable pulse</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OUT1</name>
                     <description>RTCOUT1 Output Source Selection</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>OUT1Select</name>
                        <enumeratedValue>
                           <name>NO_WAVE</name>
                           <description>No waveform, stuck at '0'</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FREQ1HZ</name>
                           <description>1 Hz square wave</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FREQ32HZ</name>
                           <description>32 Hz square wave</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FREQ64HZ</name>
                           <description>64 Hz square wave</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FREQ512HZ</name>
                           <description>512 Hz square wave</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALARM_TOGGLE</name>
                           <description>Output toggles when alarm flag rises</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALARM_FLAG</name>
                           <description>Output is a copy of the alarm flag</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PROG_PULSE</name>
                           <description>Duty cycle programmable pulse</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>THIGH</name>
                     <description>High Duration of the Output Pulse</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>THIGHSelect</name>
                        <enumeratedValue>
                           <name>H_31MS</name>
                           <description>31.2 ms</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>H_16MS</name>
                           <description>15.6 ms</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>H_4MS</name>
                           <description>3.91 ms</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>H_976US</name>
                           <description>976 us</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>H_488US</name>
                           <description>488 us</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>H_122US</name>
                           <description>122 us</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>H_30US</name>
                           <description>30.5 us</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>H_15US</name>
                           <description>15.2 us</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TPERIOD</name>
                     <description>Period of the Output Pulse</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TPERIODSelect</name>
                        <enumeratedValue>
                           <name>P_1S</name>
                           <description>1 second</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>P_500MS</name>
                           <description>500 ms</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>P_250MS</name>
                           <description>250 ms</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>P_125MS</name>
                           <description>125 ms</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMR</name>
               <description>Time Register</description>
               <addressOffset>0x08</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SEC</name>
                     <description>Current Second</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>MIN</name>
                     <description>Current Minute</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>HOUR</name>
                     <description>Current Hour</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>AMPM</name>
                     <description>Ante Meridiem Post Meridiem Indicator</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>AMPMSelect</name>
                        <enumeratedValue>
                           <name>AM</name>
                           <description>AM.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PM</name>
                           <description>PM.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMR_UTC_MODE_MODE</name>
               <description>Time Register</description>
               <alternateRegister>TIMR</alternateRegister>
               <addressOffset>0x08</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>UTC_TIME</name>
                     <description>Current UTC Time</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CALR</name>
               <description>Calendar Register</description>
               <addressOffset>0x0C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CENT</name>
                     <description>Current Century</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>YEAR</name>
                     <description>Current Year</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MONTH</name>
                     <description>Current Month</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DAY</name>
                     <description>Current Day in Current Week</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>DATE</name>
                     <description>Current Day in Current Month</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
