Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/svd/PIC32CX5112MTSH128S1.svd
            <register>
               <name>ISR</name>
               <description>Interrupt Status Register</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ENDFRAME</name>
                     <description>End of Frame Interrupt Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIS</name>
                     <description>Disable Completion Interrupt Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SMR0</name>
               <description>Segment Map Register 0</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LCD0</name>
                     <description>LCD Segment Mapped on SEGx I/O Pin</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCD1</name>
                     <description>LCD Segment Mapped on SEGx I/O Pin</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCD2</name>
                     <description>LCD Segment Mapped on SEGx I/O Pin</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCD3</name>
                     <description>LCD Segment Mapped on SEGx I/O Pin</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCD4</name>
                     <description>LCD Segment Mapped on SEGx I/O Pin</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCD5</name>
                     <description>LCD Segment Mapped on SEGx I/O Pin</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCD6</name>
                     <description>LCD Segment Mapped on SEGx I/O Pin</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCD7</name>
                     <description>LCD Segment Mapped on SEGx I/O Pin</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCD8</name>
                     <description>LCD Segment Mapped on SEGx I/O Pin</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCD9</name>
                     <description>LCD Segment Mapped on SEGx I/O Pin</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCD10</name>
                     <description>LCD Segment Mapped on SEGx I/O Pin</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCD11</name>
                     <description>LCD Segment Mapped on SEGx I/O Pin</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCD12</name>
                     <description>LCD Segment Mapped on SEGx I/O Pin</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCD13</name>
                     <description>LCD Segment Mapped on SEGx I/O Pin</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCD14</name>
                     <description>LCD Segment Mapped on SEGx I/O Pin</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCD15</name>
                     <description>LCD Segment Mapped on SEGx I/O Pin</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCD16</name>
                     <description>LCD Segment Mapped on SEGx I/O Pin</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCD17</name>
                     <description>LCD Segment Mapped on SEGx I/O Pin</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCD18</name>
                     <description>LCD Segment Mapped on SEGx I/O Pin</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCD19</name>
                     <description>LCD Segment Mapped on SEGx I/O Pin</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCD20</name>
                     <description>LCD Segment Mapped on SEGx I/O Pin</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCD21</name>
                     <description>LCD Segment Mapped on SEGx I/O Pin</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCD22</name>
                     <description>LCD Segment Mapped on SEGx I/O Pin</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCD23</name>
                     <description>LCD Segment Mapped on SEGx I/O Pin</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCD24</name>
                     <description>LCD Segment Mapped on SEGx I/O Pin</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCD25</name>
                     <description>LCD Segment Mapped on SEGx I/O Pin</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCD26</name>
                     <description>LCD Segment Mapped on SEGx I/O Pin</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCD27</name>
                     <description>LCD Segment Mapped on SEGx I/O Pin</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCD28</name>
                     <description>LCD Segment Mapped on SEGx I/O Pin</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCD29</name>
                     <description>LCD Segment Mapped on SEGx I/O Pin</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCD30</name>
                     <description>LCD Segment Mapped on SEGx I/O Pin</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCD31</name>
                     <description>LCD Segment Mapped on SEGx I/O Pin</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPMR</name>
               <description>Write Protection Mode Register</description>
               <addressOffset>0xE4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPITEN</name>
                     <description>Write Protection Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPCREN</name>
                     <description>Write Protection Control Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.</description>
                           <value>0x534C43</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>LMEMR0</name>
               <description>LSB Memory Register (com = 0)</description>
               <addressOffset>0x200</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LPIXEL</name>
                     <description>LSB Pixels Pattern Associated to COMx Terminal</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LMEMR1</name>
               <description>LSB Memory Register (com = 1)</description>
               <addressOffset>0x208</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LPIXEL</name>
                     <description>LSB Pixels Pattern Associated to COMx Terminal</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LMEMR2</name>
               <description>LSB Memory Register (com = 2)</description>
               <addressOffset>0x210</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LPIXEL</name>
                     <description>LSB Pixels Pattern Associated to COMx Terminal</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LMEMR3</name>
               <description>LSB Memory Register (com = 3)</description>
               <addressOffset>0x218</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LPIXEL</name>
                     <description>LSB Pixels Pattern Associated to COMx Terminal</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LMEMR4</name>
               <description>LSB Memory Register (com = 4)</description>
               <addressOffset>0x220</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LPIXEL</name>
                     <description>LSB Pixels Pattern Associated to COMx Terminal</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LMEMR5</name>
               <description>LSB Memory Register (com = 5)</description>
               <addressOffset>0x228</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LPIXEL</name>
                     <description>LSB Pixels Pattern Associated to COMx Terminal</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LMEMR6</name>
               <description>LSB Memory Register (com = 6)</description>
               <addressOffset>0x230</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LPIXEL</name>
                     <description>LSB Pixels Pattern Associated to COMx Terminal</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LMEMR7</name>
               <description>LSB Memory Register (com = 7)</description>
               <addressOffset>0x238</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LPIXEL</name>
                     <description>LSB Pixels Pattern Associated to COMx Terminal</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
