Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/svd/PIC32CX5112MTSH128S1.svd
            <register>
               <name>PTSR</name>
               <description>Transfer Status Register</description>
               <addressOffset>0x124</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXTEN</name>
                     <description>Receiver Transfer Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXTEN</name>
                     <description>Transmitter Transfer Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXCBEN</name>
                     <description>Receiver Circular Buffer Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXCBEN</name>
                     <description>Transmitter Circular Buffer Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERR</name>
                     <description>Transfer Bus Error</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWPMR</name>
               <description>Write Protection Mode Register</description>
               <addressOffset>0x128</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WPPTREN</name>
                     <description>Write Protection Pointer Registers Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPCTREN</name>
                     <description>Write Protection Counter Registers Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPCREN</name>
                     <description>Write Protection Control Register Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation. Always reads as 0.</description>
                           <value>0x504443</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral derivedFrom="TC0">
         <name>TC1</name>
         <baseAddress>0x4003C000</baseAddress>
         <interrupt>
            <name>TC1_CHANNEL0</name>
            <value>34</value>
         </interrupt>
         <interrupt>
            <name>TC1_CHANNEL1</name>
            <value>35</value>
         </interrupt>
         <interrupt>
            <name>TC1_CHANNEL2</name>
            <value>36</value>
         </interrupt>
         <interrupt>
            <name>TC1_C0SEC</name>
            <value>43</value>
         </interrupt>
         <interrupt>
            <name>TC1_C1SEC</name>
            <value>44</value>
         </interrupt>
         <interrupt>
            <name>TC1_C2SEC</name>
            <value>45</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TC0">
         <name>TC2</name>
         <baseAddress>0x40040000</baseAddress>
         <interrupt>
            <name>TC2_CHANNEL0</name>
            <value>37</value>
         </interrupt>
         <interrupt>
            <name>TC2_CHANNEL1</name>
            <value>38</value>
         </interrupt>
         <interrupt>
            <name>TC2_CHANNEL2</name>
            <value>39</value>
         </interrupt>
         <interrupt>
            <name>TC2_C0SEC</name>
            <value>46</value>
         </interrupt>
         <interrupt>
            <name>TC2_C1SEC</name>
            <value>47</value>
         </interrupt>
         <interrupt>
            <name>TC2_C2SEC</name>
            <value>48</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TC0">
         <name>TC3</name>
         <baseAddress>0x48008000</baseAddress>
         <interrupt>
            <name>TC3_CHANNEL0</name>
            <value>79</value>
         </interrupt>
         <interrupt>
            <name>TC3_CHANNEL1</name>
            <value>80</value>
         </interrupt>
         <interrupt>
            <name>TC3_CHANNEL2</name>
            <value>81</value>
         </interrupt>
         <interrupt>
            <name>TC3_C0SEC</name>
            <value>82</value>
         </interrupt>
         <interrupt>
            <name>TC3_C1SEC</name>
            <value>83</value>
         </interrupt>
         <interrupt>
            <name>TC3_C2SEC</name>
            <value>84</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>UART</name>
         <version>6418ZA</version>
         <description>Universal Asynchronous Receiver Transmitter</description>
         <groupName>UART</groupName>
         <prependToName>UART_</prependToName>
         <baseAddress>0x48010000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x12C</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>UART</name>
            <value>87</value>
         </interrupt>
         <registers>
            <register>
               <name>CR</name>
               <description>Control Register</description>
               <addressOffset>0x0000</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RSTRX</name>
                     <description>Reset Receiver</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTTX</name>
                     <description>Reset Transmitter</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXEN</name>
                     <description>Receiver Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXDIS</name>
                     <description>Receiver Disable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEN</name>
                     <description>Transmitter Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXDIS</name>
                     <description>Transmitter Disable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTSTA</name>
                     <description>Reset Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RETTO</name>
                     <description>Rearm Time-out</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STTTO</name>
                     <description>Start Time-out</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REQCLR</name>
                     <description>Request Clear</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OPT_SLEEP</name>
                     <description>Optical Logic Sleep Mode Command</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
